Abdelrahmanwaell/Mastering-embedded-system/Unit7_MCU_Essential_Peripherals/GPIO_Lesson3/stm32f103_GPIO/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include"stm32f103x6.h"
#include"Stm32_F103c6_gpio_driver.h"

	void clock_init()
	{
	    // enable GBIOA clock
	    RCC_GPIOA_CLK_EN();
	    // enable GBIOB clock
	    RCC_GPIOB_CLK_EN();

	}
	void GPIO_init()
	{
		GPIO_PinConfi_t pincfg;

	//A1 floating input
	pincfg.GPIO_PinNumber =GPIO_PIN_1;
	pincfg.GPIO_MODE=GPIO_MODE_INPUT_FLO;
	MCAL_GPIO_Init(GPIOA, &pincfg);

	//A13 floating input
	pincfg.GPIO_PinNumber = GPIO_PIN_13;
	pincfg.GPIO_MODE=GPIO_MODE_INPUT_FLO;
	MCAL_GPIO_Init(GPIOA, &pincfg);

	//B1 Output

	pincfg.GPIO_PinNumber =GPIO_PIN_1;
	pincfg.GPIO_MODE=GPIO_MODE_OUTPUT_PP;
	pincfg.GPIO_Output_Speed=GPIO_SPEED_10M;
	MCAL_GPIO_Init(GPIOB, &pincfg);
	//B13 Output
	pincfg.GPIO_PinNumber = GPIO_PIN_13;
	pincfg.GPIO_MODE=GPIO_MODE_OUTPUT_PP;
	pincfg.GPIO_Output_Speed=GPIO_SPEED_10M;
	MCAL_GPIO_Init(GPIOB, &pincfg);

	}

	void my_wait(int time)
	{ int i ,j;
	    for(i=0;i<time;i++)
	        for(j=0;j<255;j++);

	}

	int main(void)
	{

	    clock_init();
	    GPIO_init();



	    while(1)
	    {

	        if (MCAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)==0)
	        {
	            MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_1);
	            while (MCAL_GPIO_ReadPin(GPIOA,GPIO_PIN_1)==0);
	        }
	        if (MCAL_GPIO_ReadPin(GPIOA,GPIO_PIN_13)==1)
	        {
	        	 MCAL_GPIO_TogglePin(GPIOB, GPIO_PIN_13);

	        }
	        my_wait(1);

	    }


	return 0;

	}


